#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

//数组的初始化是指，在创建数组的同时给数组的内容一些合理初始值（初始化）。

//int main()
//{
//	//不完全初始化，剩余的元素默认初始化为0
//	int arr[10] = { 1,2,3 };
//
//	//完全初始化
//	int arr1[10] = { 1,2,3,4,5,6,7,8,9,0 };
//
//	//----------------------------------------------------
//	char ch1[10] = { 'a', 'b', 'c'};//a b c 0 0 0 0 0 0 0
//	char ch2[10] = "abc";//a b c \0 0 0 0 0 0 0
//
//	//----------------------------------------------------
//	char ch3[] = { 'a', 'b', 'c' };//a b c
//	char ch4[] = "abc";//a b c \0
//
//	return 0;
//}


//[] -- 下标引用操作符

//int main()
//{
//	//数组是使用下标来访问的，下标是从0开始。
//	int arr[] = { 1, 2, 3, 4, 5, 6, 7, 8, 9, 10 };
//	// 数组下标： 0  1  2  3  4  5  6  7  8  9
//	int i = 0;
//	int sz = sizeof(arr) / sizeof(arr[0]);
//	//打印数组的每个元素的地址
//	for (i = 0; i < sz; i++)
//	{
//		printf("&arr[%d] = %p\n", i, &arr[i]);
//	}
//
//	//for (i = 0; i < sz; i++)
//	//{
//	//	printf("%d ", arr[i]);
//	//}
//	
//	//for (i = sz - 1; i >= 0; i--)
//	//{
//	//	printf("%d ", arr[i]);
//	//}
//
//
//	return 0;
//}


