#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

//二维数组:
//1 2 3 4
//2 3 4 5 
//3 4 5 6

//int main()
//{
//	//int arr[3][4] = { 1,2,3,4,2,3,4,5,3,4,5,6 };
//	int arr[3][4] = { {1,2,3,4}, {2,3,4,5}, {3,4,5,6} };
//	int i = 0;
//	for (i = 0; i < 3; i++)//更改二维数组
//	{
//		int j = 0;
//		for (j = 0; j < 4; j++)
//		{
//			scanf("%d", &arr[i][j]);
//		}
//	}
//
//	for (i = 0; i < 3; i++)//打印二维数组
//	{
//		int j = 0;
//		for (j = 0; j < 4; j++)
//		{
//			printf("%d ", arr[i][j]);
//		}
//		printf("\n");
//	}
//
//	return 0;
//}


//知识点：
//1.可以把二维数组理解为：一维数组的数组
//2.二维数组在内存中也是连续存储的。
//3.二维数组如果有初始化，行可以省略，列不能省略


//int main()
//{
//	int arr[3][4] = { {1,2,3,4}, {2,3,4,5}, {3,4,5,6} };
//	int i = 0;
//	
//	for (i = 0; i < 3; i++)//打印二维数组的地址
//	{
//		int j = 0;
//		for (j = 0; j < 4; j++)
//		{
//			printf("&arr[%d][%d] = %p\n", i, j, &arr[i][j]);
//		}
//	}
//
//	return 0;
//}


//3. 数组越界
//数组的下标是有范围限制的。
//数组的下规定是从0开始的，如果数组有n个元素，最后一个元素的下标就是n - 1。
//所以数组的下标如果小于0，或者大于n - 1，就是数组越界访问了，超出了数组合法空间的访问。
//C语言本身是不做数组下标的越界检查，编译器也不一定报错，但是编译器不报错，并不意味着程序就
//是正确的，
//所以程序员写代码时，最好自己做越界的检查。