#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

//二维数组:
//1 2 3 4
//2 3 4 5 
//3 4 5 6

//int main()
//{
//	//int arr[3][4] = { 1,2,3,4,2,3,4,5,3,4,5,6 };
//	int arr[3][4] = { {1,2,3,4}, {2,3,4,5}, {3,4,5,6} };
//	int i = 0;
//	for (i = 0; i < 3; i++)//更改二维数组
//	{
//		int j = 0;
//		for (j = 0; j < 4; j++)
//		{
//			scanf("%d", &arr[i][j]);
//		}
//	}
//
//	for (i = 0; i < 3; i++)//打印二维数组
//	{
//		int j = 0;
//		for (j = 0; j < 4; j++)
//		{
//			printf("%d ", arr[i][j]);
//		}
//		printf("\n");
//	}
//
//	return 0;
//}


//知识点：
//1.可以把二维数组理解为：一维数组的数组
//2.二维数组在内存中也是连续存储的。
//3.二维数组如果有初始化，行可以省略，列不能省略


//int main()
//{
//	int arr[3][4] = { {1,2,3,4}, {2,3,4,5}, {3,4,5,6} };
//	int i = 0;
//	
//	for (i = 0; i < 3; i++)//打印二维数组的地址
//	{
//		int j = 0;
//		for (j = 0; j < 4; j++)
//		{
//			printf("&arr[%d][%d] = %p\n", i, j, &arr[i][j]);
//		}
//	}
//
//	return 0;
//}


//3. 数组越界
//数组的下标是有范围限制的。
//数组的下规定是从0开始的，如果数组有n个元素，最后一个元素的下标就是n - 1。
//所以数组的下标如果小于0，或者大于n - 1，就是数组越界访问了，超出了数组合法空间的访问。
//C语言本身是不做数组下标的越界检查，编译器也不一定报错，但是编译器不报错，并不意味着程序就
//是正确的，
//所以程序员写代码时，最好自己做越界的检查。


//错误示范
//int main()
//{
//	int arr[] = { 1,2,3,4,5,6 };
//	int i = 0;
//
//	for (i = 0; i < 10; i++)//数组越界访问
//	{
//		printf("%d ", arr[i]);
//	}
//
//	return 0;
//}


//正确的代码
//int main()
//{
//	int arr[] = { 1,2,3,4,5,6 };
//	int i = 0;
//	int sz = sizeof(arr) / sizeof(arr[0]);
//
//	for (i = 0; i < sz; i++)
//	{
//		printf("%d ", arr[i]);
//	}
//
//	return 0;
//}


//错误示范
//int main()
//{
//	int arr[3][4] = { 1,2,3,4,5,6,7,8,9,10,11,12 };
//	int i = 0;
//	int sz = sizeof(arr) / sizeof(arr[0]);
//
//	for (i = 0; i < 3; i++)
//	{
//		int j = 0;
//		for (j = 0; j <= 4; j++)//二维数组的越界访问
//		{
//			printf("%d ", arr[i][j]);
//		}
//	}
//
//	return 0;
//}


//数组作为函数参数：
//往往我们在写代码的时候，会将数组作为参数传个函数。
//比如：我要实现一个冒泡排序

//冒泡排序算法
//核心思想：两个相邻的元素进行比较

//例如：
//9 8 7 6 5 4 3 2 1 0 -- 需要升序
//8 9 7 6 5 4 3 2 1 0
//8 7 9 6 5 4 3 2 1 0
//8 7 6 9 5 4 3 2 1 0
//......
//8 7 6 5 4 3 2 1 0 9 -- 一趟冒泡排序 
//一趟冒泡排序让一个数据来到它最终应该出现的位置上！

//数组传参的时候，形参有2种写法：
//1.数组
//2.指针

//形参是数组的形式
void bubble_sort(int arr[])//容易理解的方式，直观
{
	//趟数
	int sz = sizeof(arr) / sizeof(arr[0]);
	int i = 0;
	for (i = 0; i < sz - 1; i++)
	{
		//一趟冒泡排序
		int j = 0;
		for (j = 0; j < sz - 1 - i; j++)
		{
			if (arr[j] > arr[j + 1])
			{
				//交换
				int tmp = arr[j];
				arr[j] = arr[j + 1];
				arr[j + 1] = tmp;
			}
		}
	}
}

int main()
{
	//把数组的数据排成升序
	int arr[] = { 9,8,7,6,5,4,3,2,1,0 };
	//输出结果：0 1 2 3 4 5 6 7 8 9
	//使用冒泡排序算法
	bubble_sort(arr);
	int i = 0;
	int sz = sizeof(arr) / sizeof(arr[0]);
	for (i = 0; i < sz; i++)//打印交换后的数组
	{
		printf("%d ", arr[i]);
	}

	return 0;
}